package com.example.generate;

/**
 * @ReturnActivity{} Інтерфейс у коді визначає методи,
 * які активність повинна реалізувати, щоб повернути дані до іншої частини коду.
 **/
public interface ReturnActivity {
    /**
     * @setText(String text): Цей метод приймає рядок text як аргумент і використовується
     * для встановлення тексту певного компонента інтерфейсу користувача
     **/
    void setText(String text);

    /**
     * @setCls(Object cls): Цей метод приймає об'єкт як аргумент і використовується для передачі даних до іншої частини вашого коду.
     * Тип об'єкта може відрізнятися залежно від реалізації, але він містить дані, які потрібно повернути попередній Activity
     **/
    void setCls(Object cls);
}
